# Formulae
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cocoapods"
brew "flyctl"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "mise"
brew "ripgrep"
brew "zoxide"
brew "ocrmypdf"
brew "pinentry-mac"
brew "supabase/tap/supabase"
brew "tmux"
brew "watchman"

tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Casks
cask "nikitabobko/tap/aerospace"
brew "FelixKratz/formulae/borders"
cask "docker-desktop"
cask "raycast"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "visual-studio-code"
